{
  "projects": {
    "title": "My Projects",
    "subtitle": "Some of the projects I've worked on",
    "learnMore": "Learn more",
    "viewProject": "View project",
    "viewCode": "View code",
    "viewDemo": "View demo",
    "recentWork": "Recent Work",
    "projects": "Projects",
    "tutorials": "Tutorials",
    "goToProjects": "View All Projects",
    "goToTutorials": "View All Tutorials",
    "back": "Back",
    "overview": "Overview",
    "goal": "Goal",
    "builtWith": "Built With",
    "githubRepository": "GitHub Repository",
    "liveDemo": "Live Demo",
    "items": {
      "starton": {
        "title": "StartOn ",
        "subtitle": "Talent-Startup Connection Platform",
        "description": "A comprehensive talent-startup connection platform featuring multi-role dashboards, internal messaging, and advanced networking capabilities.\nBuilt with Next.js 15 and React 19 for optimal performance, TypeScript for type safety, and SCSS modules for scalable styling.\nIncludes Google OAuth authentication, Supabase backend with Edge Functions, and responsive design optimized for all devices.\nThe platform offers differentiated experiences for students, founders, recruiters, and startup workers, each with tailored dashboards and permissions.\nFeatures include a robust internal messaging system for direct communication, founder networking capabilities to connect entrepreneurs, comprehensive blog system for knowledge sharing, advanced filtering by city, technology stack, and company type, and responsive panels that adapt seamlessly to any device.\nPerfect for connecting developers, designers, and tech professionals with innovative startups and companies, fostering collaboration and professional growth in the technology sector.",
        "whatIs": "StartOn is an innovative platform that connects developers, designers, and technology professionals with companies and startups seeking exceptional talent.\nThe platform democratizes access to quality job opportunities, facilitating professional growth and the development of innovative companies.\nFeatures include differentiated role-based dashboards, internal messaging system, founder networking, blogs, advanced filters, and responsive panels.",
        "problemSolved": "The technology sector lacks reliable platforms that efficiently connect emerging talent with startups and companies.\nStartOn solves this problem by enabling students, founders, and companies to meet in a segmented, secure, and fast manner, fostering collaboration and professional growth.",
        "learnings": [
          "Implemented a multi-role system (students, founders, recruiters, startup workers) with differentiated authorization.",
          "Google OAuth 2.0 and advanced JWT handling with automatic refresh.",
          "Backend development in Supabase Edge Functions for efficiency and scalability.",
          "Modular UI/UX component design with SCSS and reusable architecture in Next.js.",
          "Persistent private messaging system and advanced filters by city, technology, and company type.",
          "UX/UI optimization: mobile-first, smooth animations, scalable typography, and consistent color palette.",
          "Implementation of blogs, service pages, and founder networking system."
        ]
      },
      "property-recommender": {
        "title": "Habita",
        "subtitle": "Property Recommendation System",
        "description": "A property recommendation system developed with Next.js 15 and TypeScript.\nUses modular SCSS for clean and scalable design.\nOptimized for performance and user experience.\nThe platform features intelligent recommendation algorithms that analyze user preferences and property characteristics to suggest the most relevant listings.\nUsers can filter properties by multiple criteria including location, price range, property type, size, and amenities, with advanced sorting options to find exactly what they're looking for.\nIncludes a comprehensive admin panel where users can save favorite properties, track viewed listings, and manage their property search preferences all in one centralized location.\nThe responsive design ensures a seamless experience across all devices, from desktop to mobile, with fast loading times and intuitive navigation.\nIdeal for real estate agencies, real estate startups, or as a base for customized recommendation products that need intelligent property matching capabilities.",
        "whatIs": "A web application that recommends real estate properties based on user preferences and similarity algorithms.\nIt allows users to filter, sort, and discover properties that match their needs through a clean and responsive interface.\nBuilt with Next.js 15 and TypeScript, featuring modular SCSS for scalable styling and optimized for fast loading and user experience.\nIncludes an admin panel where users can view and manage their favorite properties.",
        "problemSolved": "Many real estate platforms overwhelm users with too many listings without effective filtering or personalized suggestions.\nThis app solves that by providing targeted recommendations, improving user satisfaction and decision-making efficiency.\nThe admin panel allows users to easily track and manage their favorite properties in one centralized location.",
        "learnings": [
          "Implemented recommendation logic using JSON data and client-side algorithms.",
          "Built a scalable and maintainable frontend architecture with Next.js and TypeScript.",
          "Applied modular SCSS for clean, reusable styling.",
          "Optimized app performance and user experience through efficient data handling and UI design.",
          "Created an admin panel for user property management and favorites tracking."
        ]
      },
      "ecommerce": {
        "title": "Quiero Sport",
        "subtitle": "Modern E-Commerce Platform",
        "description": "A comprehensive full-stack e-commerce platform featuring user authentication, product management, shopping cart functionality, and integration with Mercado Pago for payments.\nBuilt with React and Next.js for the frontend, TypeScript for type safety, and Prisma as the ORM for database interactions.\nThe application is containerized using Docker, ensuring consistent development and deployment environments.\nStyling is managed with Sass, providing modular and maintainable CSS.",
        "whatIs": "A full e-commerce platform for sports gear with product browsing, cart management, and secure checkout.\nFeatures include user authentication (NextAuth.js), order storage (PostgreSQL & Prisma), backend API routes (Next.js 13), Dockerized local setup, and deployment on Vercel.",
        "problemSolved": "Users struggled with slow, insecure, and inconsistent sports gear e-commerce sites.\nThis app delivers a fast, modern UX with secure authentication, reliable data handling (Prisma), and streamlined development (Docker).",
        "learnings": [
          "Built a full-stack Next.js app using server and client components.",
          "Designed a relational database schema for e-commerce.",
          "Implemented authentication with NextAuth.js.",
          "Managed state and side effects with React hooks.",
          "Used Prisma ORM for database operations.",
          "Set up Docker for local development and deployed on Vercel."
        ]
      },
      "healthcare-crm": {
        "title": "Medicare ",
        "subtitle": "Healthcare Treatment Management",
        "description": "A mini healthcare CRM to manage patients, medications, and treatments with dynamic assignments.\nFrontend in Next.js with dark mode, validation, responsive design, and reusable components.\nRobust backend in NestJS with unit and integration tests, and relational database in Turso.",
        "whatIs": "A full-stack web application to manage patients, medications, and treatment assignments in a digital healthcare workflow.\nIncludes dashboard views, reusable forms, input validation, dark mode, and a fully tested NestJS backend.\nBuilt with type safety, API integration, and modern UI/UX standards.",
        "problemSolved": "Managing healthcare treatments manually is error-prone and inefficient.\nThis app simplifies the process by offering structured CRUD operations, assignment tracking, and automatic remaining days calculation for active treatments.\nEnsures reliability with full-stack validation and high test coverage.",
        "learnings": [
          "Developed a full-stack TypeScript app with decoupled frontend (Next.js) and backend (NestJS).",
          "Designed relational DB schema with entities and foreign key relationships.",
          "Built RESTful APIs with full validation and error handling using class-validator and NestJS pipes.",
          "Used Turso SQLite with authentication tokens for cloud-hosted persistence.",
          "Implemented client-side and server-side form validation with reusable components.",
          "Tested core services and edge cases with unit and integration tests.",
          "Designed a responsive, accessible UI with Tailwind and dark mode toggle.",
          "Managed environment configuration for deployment across Render and Vercel."
        ]
      },
      "taskmanager": {
        "title": "Task Manager",
        "subtitle": "Full Stack Task Management App",
        "description": "An efficient task management application that allows users to create, edit, and delete tasks.\nIt includes user authentication to ensure personalized task management.\nThe frontend is developed with React and Next.js, utilizing Axios for API requests.\nThe backend leverages PostgreSQL as the relational database, interfaced through Sequelize ORM.\nStyling is handled with Sass for a clean and responsive UI.",
        "whatIs": "A comprehensive task management application built with Next.js and PostgreSQL.\nFeatures include user authentication, CRUD operations for tasks, and a clean, intuitive interface.\nThe app uses NextAuth.js for secure authentication and Sequelize ORM for database operations.",
        "problemSolved": "Users needed a simple yet powerful way to manage their tasks with secure authentication.\nThis app provides a reliable solution with user-specific task management, secure data storage,\nand a responsive design that works across all devices.",
        "learnings": [
          "Implemented user authentication with NextAuth.js.",
          "Created a relational database schema for users and tasks.",
          "Built RESTful API endpoints for CRUD operations.",
          "Set up Docker for local development environment.",
          "Implemented responsive design with CSS Modules.",
          "Managed state and API calls with Axios."
        ]
      },
      "flipper": {
        "title": "Flipper",
        "subtitle": "Twitter Clone Platform",
        "description": "A Twitter-inspired social media application supporting functionalities like tweeting, following, and live updates.\nReal-time interactions are powered by WebSockets, ensuring responsiveness and high user engagement.\nThe backend is developed with Node.js and Express, utilizing Redis for efficient data storage and retrieval.\nThe frontend employs Tailwind CSS for rapid UI development.",
        "whatIs": "A full-featured Twitter clone built with Node.js and Pug templates, styled with Tailwind CSS.\nFeatures include user authentication, real-time posts, likes, and comments.\nThe application uses a modern tech stack with Docker for containerization and Vercel for deployment.",
        "problemSolved": "Users needed a social platform to share thoughts and interact with others.\nThis app provides a familiar Twitter-like experience with essential features\nlike posting, liking, and commenting, all wrapped in a clean, responsive interface.",
        "learnings": [
          "Built a full-stack application using Node.js and Express.",
          "Implemented server-side rendering with Pug templates.",
          "Created a responsive and interactive user interface.",
          "Set up Docker for containerization and deployment.",
          "Implemented real-time features for social interaction.",
          "Deployed the application on Vercel."
        ]
      },
      "vestire": {
        "title": "Vestiré",
        "subtitle": "Fashion E-Commerce Platform",
        "description": "An e-commerce platform specializing in clothing, offering a wide selection of products with intuitive navigation and a seamless checkout process.\nThe frontend is built with React, while the backend utilizes Node.js and Express for server-side operations.\nAxios is used for handling HTTP requests, and PostgreSQL serves as the database.\nThe application includes user authentication to manage user sessions and orders.",
        "whatIs": "A sleek and modern e-commerce platform for fashion and accessories, built with React and styled with CSS.\nFeatures include user authentication, product browsing, shopping cart functionality, and a clean, responsive design.\nThe application showcases a collection of clothing items, sneakers, and accessories with detailed product information.\nIncludes secure user authentication and session management for a personalized shopping experience.",
        "problemSolved": "Local fashion retailers needed a modern online presence to reach customers.\nThis app provides an elegant solution with an intuitive shopping experience,\nshowcasing products with high-quality images and detailed descriptions.\nSecure authentication ensures users can safely manage their accounts and orders.",
        "learnings": [
          "Built a responsive e-commerce interface with React.",
          "Implemented secure user authentication with JWT.",
          "Created an intuitive product browsing experience.",
          "Developed RESTful APIs with Node.js and Express.",
          "Managed database operations with PostgreSQL.",
          "Deployed the application on Vercel.",
          "Implemented modern UI/UX practices."
        ]
      },
      "trip-planner": {
        "title": "Trip Planner",
        "subtitle": "Travel Planning Application",
        "description": "An application designed to simplify trip planning with itinerary management and other travel tools.\nIts effective navigation and smooth design enhance the user experience significantly.\nThe frontend is developed with React, while the backend uses Node.js and Express.\nAxios handles HTTP requests, and MongoDB serves as the database for storing trip data.",
        "whatIs": "An application designed to simplify trip planning with itinerary management and other travel tools.\nIts effective navigation and smooth design enhance the user experience significantly.\nThe frontend is developed with React, while the backend uses Node.js and Express.\nAxios handles HTTP requests, and MongoDB serves as the database for storing trip data.",
        "problemSolved": "Planning trips can be overwhelming with multiple tools and scattered information.\nThis app centralizes trip planning, making it easy to organize itineraries, manage travel details,\nand access everything in one convenient location.",
        "learnings": [
          "Built a full-stack application with React and Node.js.",
          "Implemented MongoDB for flexible data storage.",
          "Created intuitive trip management features.",
          "Developed RESTful APIs with Express.",
          "Managed HTTP requests with Axios.",
          "Designed a user-friendly interface for travel planning."
        ]
      },
      "dynamic-blog": {
        "title": "Dynamic Blog",
        "subtitle": "RSS Feed Blog Application",
        "description": "A responsive blog application that fetches posts from an RSS feed (TechCrunch) and user-generated content from Airtable.\nFeatures include dynamic routing, user blog management, and a clean, responsive design.\nBuilt with Next.js for server-side rendering and Tailwind CSS for styling.\nThe application parses RSS feeds and integrates with Airtable's API to manage content.",
        "whatIs": "A responsive blog application that fetches posts from an RSS feed (TechCrunch) and user-generated content from Airtable.\nFeatures include dynamic routing, user blog management, and a clean, responsive design.\nBuilt with Next.js for server-side rendering and Tailwind CSS for styling.\nThe application parses RSS feeds and integrates with Airtable's API to manage content.",
        "problemSolved": "Content creators and readers needed a unified platform to access both external RSS feeds and custom blog content.\nThis app provides a seamless experience by combining RSS feed parsing with Airtable integration,\nallowing users to manage and display content from multiple sources in one place.",
        "learnings": [
          "Implemented RSS feed parsing and integration.",
          "Integrated Airtable API for content management.",
          "Built dynamic routing with Next.js.",
          "Created a responsive design with Tailwind CSS.",
          "Managed server-side rendering for optimal performance.",
          "Developed a clean and intuitive user interface."
        ]
      },
      "holistic-portal": {
        "title": "Holistic Portal",
        "subtitle": "Alternative Therapies Website",
        "description": "An informative website showcasing alternative therapies, offering descriptions, client testimonials, and booking options.\nIt focuses on user interaction and professional presentation.\nThe site is built with HTML and CSS, utilizing Sass for enhanced styling capabilities.",
        "whatIs": "An informative website showcasing alternative therapies, offering descriptions, client testimonials, and booking options.\nIt focuses on user interaction and professional presentation.\nThe site is built with HTML and CSS, utilizing Sass for enhanced styling capabilities.",
        "problemSolved": "Alternative therapy practitioners needed a professional online presence to showcase their services and connect with clients.\nThis website provides an elegant solution with clear service descriptions, client testimonials,\nand easy booking options, all presented in a clean and professional design.",
        "learnings": [
          "Built a static website with HTML and CSS.",
          "Utilized Sass for enhanced styling capabilities.",
          "Created a professional and informative design.",
          "Implemented client testimonials and booking features.",
          "Focused on user experience and professional presentation."
        ]
      },
      "greengrocery": {
        "title": "Greengrocery",
        "subtitle": "Fresh Groceries Online Store",
        "description": "An online store specializing in fresh groceries with a shopping cart and an optimized shopping experience.\nIt incorporates testing with Jest, ensuring smooth functionality and higher conversion rates for users.\nThe frontend is developed with React, utilizing Axios for API interactions and Tailwind CSS for styling.",
        "whatIs": "An online store specializing in fresh groceries with a shopping cart and an optimized shopping experience.\nIt incorporates testing with Jest, ensuring smooth functionality and higher conversion rates for users.\nThe frontend is developed with React, utilizing Axios for API interactions and Tailwind CSS for styling.",
        "problemSolved": "Customers needed a reliable and user-friendly platform to purchase fresh groceries online.\nThis app provides a seamless shopping experience with an intuitive interface, efficient cart management,\nand comprehensive testing to ensure reliability and user satisfaction.",
        "learnings": [
          "Built a responsive e-commerce interface with React.",
          "Implemented comprehensive testing with Jest.",
          "Created an optimized shopping cart experience.",
          "Developed API interactions with Axios.",
          "Styled the application with Tailwind CSS.",
          "Focused on user experience and conversion optimization."
        ]
      },
      "lexmax": {
        "title": "LexMax",
        "subtitle": "Judicial Case Management Platform",
        "description": "A web platform for managing judicial case files that automates tasks and improves productivity for law firms.\nIncludes comprehensive case file management with detailed tracking of all judicial proceedings, legal notices and operations monitoring to ensure timely responses, AI-powered event tracking that detects relevant events and automatically suggests actions, complete document management system for organizing legal documents, automated notifications via Gmail and Telegram to keep teams informed in real-time, advanced filters and search capabilities for quick information retrieval, comprehensive dashboard with statistics and interactive charts for data visualization, and a secure authentication system with JWT tokens.\nThe platform centralizes all judicial information in one place, eliminating the need for multiple systems, and facilitates efficient case tracking with automated workflows that reduce manual errors and improve response times.\nDesigned specifically for law firms seeking to modernize their operations and increase productivity through intelligent automation.",
        "whatIs": "LEXMAX is a web platform for managing judicial case files that automates tasks and improves productivity for law firms.\nIt includes comprehensive case file management, legal notices and operations tracking, AI-powered event monitoring that detects relevant events and suggests actions, document management, automated notifications via Gmail and Telegram, advanced filters and search capabilities, a dashboard with statistics and charts, and a secure authentication system.\nThe platform centralizes all judicial information and facilitates efficient case tracking.",
        "problemSolved": "Law firms face difficulties organizing and tracking case files, legal notices, and operations.\nLEXMAX solves this by centralizing information, automating notifications, using AI to detect relevant events and suggest actions, and offering advanced filters and search capabilities to quickly find information, improving efficiency and reducing errors.",
        "learnings": [
          "Built a full-stack application with React and Vite for optimal performance.",
          "Implemented secure authentication using JWT tokens.",
          "Integrated AI capabilities for intelligent event detection and action suggestions.",
          "Developed automated notification systems with Gmail OAuth and Telegram API.",
          "Created advanced filtering and search functionality for efficient data retrieval.",
          "Built a comprehensive dashboard with statistics and data visualization.",
          "Designed a scalable architecture with Node.js and Express backend.",
          "Implemented responsive design with SCSS for optimal user experience."
        ]
      },
      "lexmax-landing": {
        "title": "LexMax Landing",
        "subtitle": "Legal Automation Landing Page",
        "description": "LEXMAX is a professional landing page for a legal automation platform that connects law firms with intelligent technological solutions.\nThe page presents legal automation services, including case file management, intelligent bots, massive document generation, and AI-powered analysis.\nFeatures include a hero section with impact statistics, presentation of 6 main services, company section with purpose and vision, interactive contact form with copy functionality, responsive navigation with hamburger menu, modern design with visual effects, and reusable modular components.",
        "whatIs": "LEXMAX is a professional landing page for a legal automation platform that connects law firms with intelligent technological solutions.\nThe page presents legal automation services, including case file management, intelligent bots, massive document generation, and AI-powered analysis.\nFeatures include a hero section with impact statistics, presentation of 6 main services, company section with purpose and vision, interactive contact form with copy functionality, responsive navigation with hamburger menu, modern design with visual effects, and reusable modular components.",
        "problemSolved": "The traditional legal sector lacks effective digital presence to communicate innovative technological solutions.\nLEXMAX solves this problem by providing a landing page that clearly and professionally presents legal automation capabilities, facilitating the conversion of visitors into potential clients through an attractive design, structured information, and strategic call-to-actions that highlight the platform's benefits.",
        "learnings": [
          "Built a modern landing page with Next.js for optimal SEO and performance.",
          "Implemented responsive design with Tailwind CSS and SCSS for flexible styling.",
          "Created an interactive contact form with copy-to-clipboard functionality.",
          "Designed a hero section with animated statistics and visual impact.",
          "Developed reusable modular components for maintainable code structure.",
          "Implemented responsive navigation with hamburger menu for mobile devices.",
          "Created visual effects and animations to enhance user engagement.",
          "Optimized page performance and loading times with Next.js optimizations."
        ]
      },
      "the-club-northfield": {
        "title": "The Club at Northfield",
        "subtitle": "Corporate Website for Sports & Fitness Club - Ontario, Canada",
        "description": "Corporate website for The Club at Northfield, a racquet sports and fitness club in Kitchener-Waterloo, Ontario, Canada.\nIncludes CMS integration for content management, dynamic event system, services and athletics sections, membership plans, interactive FAQ, and responsive design.\nThe site is optimized for static export and offers a smooth user experience with banner carousels, intuitive navigation, and modular components.",
        "whatIs": "Corporate website for The Club at Northfield, a racquet sports and fitness club in Kitchener-Waterloo, Ontario, Canada.\nIncludes CMS integration with Strapi for content management, dynamic event system, services and athletics sections, membership plans, interactive FAQ, and fully responsive design.\nThe site is optimized for static export and offers a smooth user experience with banner carousels, intuitive navigation, and modular components that ensure easy content updates without technical intervention.",
        "problemSolved": "Create a web presence that showcases the club's facilities, services, and events, making information easily accessible to members and visitors.\nThe site integrates a CMS so the team can update content without technical intervention, keeping information current about events, services, membership plans, and the team.",
        "learnings": [
          "Built a corporate website with Next.js for optimal performance and SEO.",
          "Integrated Strapi CMS for headless content management.",
          "Created a dynamic event system with automatic updates.",
          "Developed responsive design with Tailwind CSS and SCSS.",
          "Implemented banner carousels and interactive components.",
          "Optimized for static export and fast loading times.",
          "Designed modular components for easy maintenance.",
          "Created an intuitive navigation system for better user experience."
        ]
      },
      "event-scheduler": {
        "title": "Event Scheduler",
        "subtitle": "Event Booking & Venue Management Platform",
        "description": "Event Scheduler is a full-stack platform that connects event organizers with venues (event spaces). Developed for a client in Canada.\nThe platform includes two interfaces: an administration portal for venues to configure their spaces through a 13-step onboarding process, and a public website where users can discover, configure, and book spaces for their events.\nFeatures include space and amenities management, real-time price calculation, interactive map integration, image galleries, customizable catering packages, preferred vendor management, policy and restrictions system, contract management and visualization (PDF, Word, SVG) with terms acceptance, payment processing with Stripe and credit/debit cards, auto-save with data loss protection, real-time validation on all forms, accessibility system (ADA/ACA compliance), schedule and availability management, event coordination, complete preview before finalizing, and responsive design.",
        "whatIs": "Event Scheduler is a full-stack platform that connects event organizers with venues (event spaces).\nThe platform includes two interfaces: an administration portal for venues to configure their spaces through a 13-step onboarding process with validation and auto-save, and a public website where users can discover, configure, and book spaces for their events.\nFeatures include space and amenities management, real-time price calculation, interactive map integration with Leaflet, image galleries with Google Cloud Storage, customizable catering packages, preferred vendor management, policy and restrictions system, contract management and visualization (PDF, Word, SVG) with terms acceptance, payment processing with Stripe and credit/debit cards, auto-save with data loss protection, real-time validation on all forms, accessibility system (ADA/ACA compliance), schedule and availability management, event coordination, complete preview before finalizing, and fully responsive design.",
        "problemSolved": "The event space booking market lacks comprehensive platforms that facilitate both venue management and booking experience for clients.\nEvent Scheduler solves this problem by offering a dual system that allows venue owners to completely configure their spaces through a guided step-by-step process with validation and auto-save, while event organizers can discover and book spaces intuitively, with detailed information about capacity, amenities, prices, availability, policies, and contracts, all in a single platform with secure payment processing.",
        "learnings": [
          "Built a full-stack platform with Next.js, React, and TypeScript for type safety and optimal performance.",
          "Developed a complex 13-step onboarding process with real-time validation and auto-save functionality.",
          "Integrated Stripe for secure payment processing with credit and debit cards.",
          "Implemented interactive maps with Leaflet for venue location visualization.",
          "Created a comprehensive contract management system supporting PDF, Word, and SVG formats.",
          "Developed real-time price calculation based on space, amenities, and catering packages.",
          "Implemented Google Cloud Storage for efficient image and document management.",
          "Built accessibility features ensuring ADA/ACA compliance throughout the platform.",
          "Created comprehensive testing suite with Jest, React Testing Library, and Playwright.",
          "Designed a dual-interface system (admin portal and public website) with shared components.",
          "Implemented auto-save functionality to prevent data loss during form completion.",
          "Developed a complete event coordination system with availability management."
        ]
      },
      "ateevo-wholesale": {
      "title": "Ateevo Wholesale",
      "subtitle": "B2B E-Commerce Platform for Fashion",
      "description": "B2B e-commerce platform designed for fashion brands managing wholesale operations. Developed for a client in Canada.\nAllows wholesale customers to browse seasonal catalogs, place orders, and track shipments, while providing administrators with tools for product management, inventory, order processing, and customer relationships.\nArchitected as a multi-tenant SaaS application, supporting multiple independent brands with complete data isolation and per-tenant custom branding.",
      "whatIs": "Ateevo Wholesale is a B2B e-commerce platform for fashion brands managing wholesale operations. Developed for a client in Canada.\n\nThe platform enables wholesale customers to browse seasonal catalogs, place orders, and track shipments, while providing administrators with tools for product management, inventory, order processing, and customer relationships.\n\nMulti-tenant SaaS architecture supporting multiple independent brands with complete data isolation and customizable white-label branding.\n\nKey Features:\n\n• Multi-Tenant Architecture with isolated PostgreSQL databases and customizable branding\n• Digital Contract Signing with canvas-captured signatures and automatic PDF generation\n• Real-Time Notifications with alert center and persistent notifications\n• Advanced Reporting: Availability and Margin Reports with multi-currency support (USD, CAD, MXN)\n• Seasonal Management with availability dates, pre-orders, and estimated shipping dates\n• Multi-Currency Pricing (USD, CAD, MXN) with MSRP and automatic conversion\n• Complete Order Management workflow from New to Invoice Paid with PDF export\n• Advanced Inventory System with multiple metrics (On Hand, Available to Sell, Available to Ship)\n• Product Catalog with multiple images, automatic variants, and SKU/MFC codes\n• Customer Management with multiple addresses, billing info, and order history\n• Dashboard & Analytics with configurable metrics and trend charts\n• Super Admin Panel for managing multiple tenants and database creation\n• Enterprise Security with JWT authentication, bcrypt-hashed passwords, and role-based permissions",
      "problemSolved": "The wholesale fashion sector lacks modern platforms that efficiently connect brands with their wholesale customers.\nAteevo Wholesale solves this problem by allowing brands to manage their catalog, inventory, and orders centrally, while customers can browse, order, and track their purchases intuitively, all with digitally signed contracts and advanced margin and availability reports.\nThe multi-tenant architecture allows scaling the business by supporting multiple brands on a single platform with complete security and customization.",
      "learnings": [
        "Multi-tenant architecture with isolated PostgreSQL databases per tenant and customizable white-label branding (custom logo, primary/secondary colors, contact information, dynamic storefront color adaptation without page reload).",
        "Digital contract signing system with canvas-captured hand signatures, timestamps, IP addresses, automatic PDF generation, contract states (pending, signed_by_customer, signed_by_admin, fully_signed, cancelled), and support for multiple contracts per order (complete and partial invoices).",
        "Real-time notification system with alert center bell icon, automatic notifications for contract signature requirements, unique floating notification when admin requests signature, persistent notifications until read, and direct navigation to order from notification.",
        "Advanced Availability Report showing available products for sale, identifying which customers ordered each product, allowing \"stealing\" items from existing orders for new orders, with filters for products with orders vs available products.",
        "Advanced Margin Report calculating profit margins per product based on costs and sale prices, multi-currency support (USD, CAD), identifying products without cost data with direct action buttons, automatic calculations of revenue, cost, margin and margin percentage, counting only \"Shipped\" or \"Invoice Paid\" orders as completed sales.",
        "Seasonal product management with products organized by seasons (Spring 2025, Fall/Winter, etc.), availability dates and estimated shipping dates, products marked as \"Pre-order\" for future seasons, current season highlighting, splash images per season, and customers seeing estimated shipping dates based on product seasons.",
        "Complete multi-currency pricing system with prices in USD, CAD, and MXN, customers seeing prices in their base currency by country, MSRP (Manufacturer Suggested Retail Price) per currency, costs per currency for accurate margin calculations, and automatic conversion and display.",
        "Comprehensive order management with full state workflow (New, Draft, Submitted, Confirmed, Booked, Shipped, Invoice Sent, Invoice Pending, Invoice Overdue, Invoice Paid, Cancel), customers creating orders from storefront, admins creating orders manually, full order editing by admins (add/remove/adjust items), optional customer PO numbers, internal notes for admins only, PDF export of orders, and complete state change history.",
        "Advanced inventory system with multiple metrics: On Hand (physical stock available), Available to Sell (stock minus pending orders), Available to Ship (stock available for immediate shipping), Pending Orders (quantity committed in orders), Supplier Orders Pending (incoming stock from suppliers), with advanced filters, search, quick quantity editing, and variant view (colors/sizes) with individual stock.",
        "Product catalog management with multiple images per product (up to 5) with featured image, automatic variants (colors × sizes = complete matrix), prices and costs per variant, customizable categories, assignment to multiple seasons, SKU and MFC (Manufacturer Code), descriptions and materials, and advanced search and filtering.",
        "Customer management panel with account creation and editing, multiple shipping addresses per customer, billing information, account activation/deactivation, complete order history per customer, and password reset functionality.",
        "Administrative dashboard with configurable total sales (by period), total number of orders, number of active customers, sales trend charts, recent orders list, best-selling products, and real-time updates.",
        "Super admin panel for platform administration with management of multiple tenants, creation of new tenants with automatic databases, tenant impersonation for support, tenant activation/deactivation, and view of all tenants and their status.",
        "Fully responsive design optimized for desktop, tablet, and mobile with adaptive navigation, touch-optimized forms and tables, and consistent experience across all devices.",
        "Enterprise security with secure architecture and complete isolation: each tenant has its own PostgreSQL database, JWT authentication with secure tokens, bcrypt-hashed passwords, role-based permission validation (Customer, Admin, Super Admin), tenant headers for correct routing, ensuring privacy and data compliance."
      ]
      }
    }
  },
  "pages": {
    "projects": {
      "title": "Projects",
      "subtitle": "Selected works that reflect how I think, build, and solve problems"
    },
    "tutorials": {
      "title": "Tutorials",
      "subtitle": "From theory to implementation — focused tutorials for real development"
    }
  }
}
